Финансы/src/DataProcessors/ЗагрузкаДанныхИзБанкКлиента/ЗагрузкаДанныхИзБанкКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДанныхИзБанкКлиента</name>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредварительныеДанные</name>
    <attributes>
      <name>ПрочитаннаяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДвижения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТранзакции</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаОплаты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоПлатежа</name>
      <type>
        <types>CatalogRef.МестаРасходовДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоходовРасходов</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Финансы/src/InformationRegisters/СоответствияТочекОплатыИЦелейЗаргузки/СоответствияТочекОплатыИЦелейЗаргузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствияТочекОплатыИЦелейЗаргузки</name>
  <resources>
    <name>МестоПлатежа</name>
    <type>
      <types>CatalogRef.МестаРасходовДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДоходовРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </resources>
  <attributes>
    <name>ИсправленоВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТочкаОплаты</name>
    <type>
      <types>CatalogRef.МестаТранзакцийИзБанкКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Финансы/src/Documents/ПриходДенежныхСредств/ПриходДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ОстаткиДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СразуЗачислять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Расшифровка</name>
    <attributes>
      <name>СтатьяДоходов</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Финансы/src/Documents/РасходДенежныхСредств/РасходДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходДенежныхСредств</name>
  <basedOn>Document.СчетНаОплату</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиДенежныхСредств</registerRecords>
  <registerRecords>InformationRegister.ИсторияЦенПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРасходовДенежныхСредств</name>
    <type>
      <types>CatalogRef.МестаРасходовДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СразуСписывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоТранзакцииИзБанкКлиента</name>
    <type>
      <types>CatalogRef.МестаТранзакцийИзБанкКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧекРасшифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОтвета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЧека</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Расшифровка</name>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Финансы/src/DataProcessors/ЗагрузкаДанныхИзБанкКлиента/Forms/Форма/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьДату(Стр)
	
	Если СтрДлина(Стр) = 10 Тогда
		Попытка
			Возврат Дата(Прав(Стр, 4), Сред(Стр, 4, 2), Лев(Стр, 2));
		Исключение
			ТекстСообщения = "При преобразовании даты %1 возникла ошибка %2.";
			Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка(Стр), ОписаниеОшибки()));
			Возврат Дата(1,1,1);
		КонецПопытки;
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЧисло(Стр)
	
	Попытка
		Возврат Число(СтрЗаменить(Стр, ",", ""));
	Исключение
		ТекстСообщения = "При преобразовании даты %1 возникла ошибка %2.";
		Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка(Стр), ОписаниеОшибки()));
		Возврат Дата(1,1,1);
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ОбработатьЗагруженнуюСтроку(ЗагруженнаяСтрока)
	
	СтрокаСчетаДляБанкКлиента = "";
	ДлинаСтрокаСчетаДляБанкКлиента = 0;
	
	Если ЗначениеЗаполнено(Объект.СчетУчета) Тогда
		СтрокаСчетаДляБанкКлиента = Объект.СчетУчета.СтрокаСчетаДляБанкКлиента;
		ДлинаСтрокаСчетаДляБанкКлиента = СтрДлина(СтрокаСчетаДляБанкКлиента);
	КонецЕсли;
	
	МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЗагруженнаяСтрока, ";");
	
	Если МассивПодстрок.Количество() = 6 Тогда
	
		НС = Объект.ПредварительныеДанные.Добавить();
		
		НС.ПрочитаннаяСтрока	= ЗагруженнаяСтрока;
		НС.ДатаТранзакции		= ПолучитьДату(МассивПодстрок[1]);
		НС.ДатаДвижения			= ПолучитьДату(МассивПодстрок[2]);
		НС.ТочкаОплаты			= МассивПодстрок[3];
		НС.СуммаПлатежа			= ПолучитьЧисло(МассивПодстрок[5]);
		
		Если ДлинаСтрокаСчетаДляБанкКлиента <> 0 Тогда
			
			Если Лев(НС.ТочкаОплаты, ДлинаСтрокаСчетаДляБанкКлиента) = СтрокаСчетаДляБанкКлиента Тогда
				
				НС.ТочкаОплаты = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(Сред(НС.ТочкаОплаты, ДлинаСтрокаСчетаДляБанкКлиента + 1), " ");
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЦелейЗагрузки(ТаблицаДанных)
	
	МассивТочекОплаты = Новый Массив;
	
	Для каждого Стр Из Объект.ПредварительныеДанные Цикл
		
		Если МассивТочекОплаты.Найти(Стр.ТочкаОплаты) = Неопределено Тогда
			МассивТочекОплаты.Добавить(Стр.ТочкаОплаты);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоответствияТочекОплатыИЦелейЗаргузки.ТочкаОплаты,
		|	СоответствияТочекОплатыИЦелейЗаргузки.МестоПлатежа,
		|	СоответствияТочекОплатыИЦелейЗаргузки.СтатьяДоходовРасходов
		|ИЗ
		|	РегистрСведений.СоответствияТочекОплатыИЦелейЗаргузки КАК СоответствияТочекОплатыИЦелейЗаргузки
		|ГДЕ
		|	СоответствияТочекОплатыИЦелейЗаргузки.ТочкаОплаты В(&МассивТочекОплаты)";

	Запрос.УстановитьПараметр("МассивТочекОплаты", МассивТочекОплаты);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоответствияТочекОплатыИЦелейЗаргузки()
Перем ТаблицаДанных;

	ЗаполнитьТаблицуЦелейЗагрузки(ТаблицаДанных);

	Для каждого Стр Из Объект.ПредварительныеДанные Цикл
		
		НайденнаяСтрока = ТаблицаДанных.Найти(Стр.ТочкаОплаты, "ТочкаОплаты");
		
		Если НайденнаяСтрока = Неопределено Тогда
			ТекстСообщения = "Точка оплаты ""%1"" не найдена.";
			Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Стр.ТочкаОплаты));
		Иначе
		    Стр.МестоПлатежа			= НайденнаяСтрока.МестоПлатежа;
			Стр.СтатьяДоходовРасходов	= НайденнаяСтрока.СтатьяДоходовРасходов;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеНаСервере(АдресДанныхФайла)
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресДанныхФайла);
	
	Если ТипЗнч(ДвоичныеДанные) <> Тип("ДвоичныеДанные") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВременногоТекстовогоФайла = ПолучитьИмяВременногоФайла();
	
	ДвоичныеДанные.Записать(ИмяВременногоТекстовогоФайла);
	Текст = Новый ЧтениеТекста(ИмяВременногоТекстовогоФайла, КодировкаТекста.ANSI);
	
	Объект.ПредварительныеДанные.Очистить();
	
	Стр = Текст.ПрочитатьСтроку();
	
	Пока Стр <> Неопределено Цикл
		
		ОбработатьЗагруженнуюСтроку(Стр);
		
	    Стр = Текст.ПрочитатьСтроку();
		
	КонецЦикла;
	
	Текст.Закрыть();
	
	ЗаполнитьСоответствияТочекОплатыИЦелейЗаргузки();
	
	Попытка
		УдалитьФайлы(ИмяВременногоТекстовогоФайла);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНовыеЦелиЗагрузкиНаСервере(МестоПлатежа = Неопределено, СтатьяДоходовРасходов = Неопределено)
Перем ТаблицаДанных;

	ЗаполнитьТаблицуЦелейЗагрузки(ТаблицаДанных);
	
	НачатьТранзакцию();
	
	Для каждого Стр Из Объект.ПредварительныеДанные Цикл
		
		НайденнаяСтрока = ТаблицаДанных.Найти(Стр.ТочкаОплаты, "ТочкаОплаты");
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			ТекстСообщения = "Добавляю точку оплаты ""%1"" по данным строки %2.";
			Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Стр.ТочкаОплаты, Стр.НомерСтроки));
			
			НаборЗаписей = РегистрыСведений.СоответствияТочекОплатыИЦелейЗаргузки.СоздатьНаборЗаписей();
			    
			НаборЗаписей.Отбор.ТочкаОплаты.Установить(Стр.ТочкаОплаты);
			    
			НоваяЗапись = НаборЗаписей.Добавить();

			НоваяЗапись.ТочкаОплаты				= Стр.ТочкаОплаты;
			НоваяЗапись.МестоПлатежа			= МестоПлатежа;
			НоваяЗапись.СтатьяДоходовРасходов	= СтатьяДоходовРасходов;

			НаборЗаписей.Записать();

		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Функция СохранитьДанныеНаСервере()
	
	ЕстьОшибки = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.СчетУчета) Тогда
		ТекстСообщения = "Не заполнен счет учета.";
		Сообщить(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Для Каждого Стр Из Объект.ПредварительныеДанные Цикл
		
		Если Не ЗначениеЗаполнено(Стр.ДатаТранзакции) Тогда
			ТекстСообщения = "В строке %1 не заполнена дата транзакции.";
			Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Стр.НомерСтроки));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.СтатьяДоходовРасходов) Тогда
			ТекстСообщения = "В строке %1 не заполнена статья доходов / расходов.";
			Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Стр.НомерСтроки));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Для Каждого Стр Из Объект.ПредварительныеДанные Цикл
		
		Если Стр.СуммаПлатежа >= 0 Тогда
			НовыйДокумент = Документы.ПриходДенежныхСредств.СоздатьДокумент();
			НовыйДокумент.СуммаДокумента = Стр.СуммаПлатежа;
			НовыйДокумент.СразуЗачислять = Истина;
		Иначе
			НовыйДокумент = Документы.РасходДенежныхСредств.СоздатьДокумент();
			НовыйДокумент.МестоРасходовДенежныхСредств = Стр.МестоПлатежа;
			НовыйДокумент.СуммаДокумента = -Стр.СуммаПлатежа;
			НовыйДокумент.СразуСписывать = Истина;
		КонецЕсли;
		НовыйДокумент.Дата = ?(Стр.ДатаДвижения = Дата(1,1,1), Стр.ДатаТранзакции, Стр.ДатаДвижения);
		НовыйДокумент.СчетУчета = Объект.СчетУчета;
		НовыйДокумент.ВалютаДокумента = Объект.СчетУчета.ВалютаСчета;
		НовыйДокумент.Комментарий = Стр.ТочкаОплаты;
		
		НоваяСтрока = НовыйДокумент.Расшифровка.Добавить();
		Если Стр.СуммаПлатежа >= 0 Тогда
			НоваяСтрока.СтатьяДоходов = Стр.СтатьяДоходовРасходов;
			НоваяСтрока.Цена = Стр.СуммаПлатежа;
			НоваяСтрока.Сумма = Стр.СуммаПлатежа;
		Иначе
			НоваяСтрока.СтатьяРасходов = Стр.СтатьяДоходовРасходов;
			НоваяСтрока.Цена = -Стр.СуммаПлатежа;
			НоваяСтрока.Сумма = -Стр.СуммаПлатежа;
		КонецЕсли;
		НоваяСтрока.Количество = 1;
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура КнопкаПрочитатьДанные(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Файлы обмена (*.csv)|*.csv";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ФайлДляПроверки = Новый Файл(ДиалогОткрытияФайла.ПолноеИмяФайла);
		Если ФайлДляПроверки.Существует() Тогда
			Если ФайлДляПроверки.Размер() <= 10000000 Тогда
				ДвоичныеДанные = Новый ДвоичныеДанные(ДиалогОткрытияФайла.ПолноеИмяФайла);
				АдресДанныхФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
				ПрочитатьДанныеНаСервере(АдресДанныхФайла);
			Иначе
				ПоказатьПредупреждение(, "Ошибка! Файл " + ДиалогОткрытияФайла.ПолноеИмяФайла + " имеет размер больше 10 Мб.");
			КонецЕсли;
		Иначе
			ПоказатьПредупреждение(, "Ошибка!Файл " + ДиалогОткрытияФайла.ПолноеИмяФайла + " не существует.");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТочкиОплатИЦелейЗагрузки(Команда)
	
	ОткрытьФорму("РегистрСведений.СоответствияТочекОплатыИЦелейЗаргузки.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНовыеЦелиЗагрузки(Команда)
	
	ВремФорма = ПолучитьФорму("Обработка.ЗагрузкаДанныхИзБанкКлиента.Форма.ФормаЦелейСоЗначениямиПоУмолчанию");
	СтруктураСДаными = ВремФорма.ОткрытьМодально();
	
	Если ТипЗнч(СтруктураСДаными) <> Тип("Структура") Тогда
		ЗаполнитьНовыеЦелиЗагрузкиНаСервере();
	Иначе
		ЗаполнитьНовыеЦелиЗагрузкиНаСервере(СтруктураСДаными.МестоПлатежа, СтруктураСДаными.СтатьяДоходовРасходов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСохранитьДанныеВБазе(Команда)
	
	Если СохранитьДанныеНаСервере() Тогда
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры
